# pandas - merging two datasets

In [2]:
import pandas as pd

In [1]:
# let's create some dataset

In [7]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'], 'var1' : [37, 36, 43, 23], 'var2': [120, 117, 230, 315]})

In [8]:
print(df1)

  id  var1  var2
0  A    37   120
1  B    36   117
2  C    43   230
3  D    23   315

In [9]:
df2 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'], 'var3' : [12, 16, 13, 18], 'var4': [75, 54, 21, 36]})

In [10]:
print(df2)

  id  var3  var4
0  A    12    75
1  B    16    54
2  C    13    21
3  D    18    36

In [11]:
df3 = pd.DataFrame({'id': ['A', 'A', 'B', 'B'], 'var3' : [2, 6, 3, 8], 'var4': [7, 5, 2, 6]})

In [12]:
print(df3)

  id  var3  var4
0  A     2     7
1  A     6     5
2  B     3     2
3  B     8     6

In [13]:
df1.append(df2)

  id  var1   var2  var3  var4
0  A  37.0  120.0   NaN   NaN
1  B  36.0  117.0   NaN   NaN
2  C  43.0  230.0   NaN   NaN
3  D  23.0  315.0   NaN   NaN
0  A   NaN    NaN  12.0  75.0
1  B   NaN    NaN  16.0  54.0
2  C   NaN    NaN  13.0  21.0
3  D   NaN    NaN  18.0  36.0

In [14]:
print(df3.append(df1))

  id  var1   var2  var3  var4
0  A   NaN    NaN   2.0   7.0
1  A   NaN    NaN   6.0   5.0
2  B   NaN    NaN   3.0   2.0
3  B   NaN    NaN   8.0   6.0
0  A  37.0  120.0   NaN   NaN
1  B  36.0  117.0   NaN   NaN
2  C  43.0  230.0   NaN   NaN
3  D  23.0  315.0   NaN   NaN

In [ ]:
# to join more datasets we can use .concat() from pandas

In [15]:
print(pd.concat([df1, df2, df3]))

  id  var1   var2  var3  var4
0  A  37.0  120.0   NaN   NaN
1  B  36.0  117.0   NaN   NaN
2  C  43.0  230.0   NaN   NaN
3  D  23.0  315.0   NaN   NaN
0  A   NaN    NaN  12.0  75.0
1  B   NaN    NaN  16.0  54.0
2  C   NaN    NaN  13.0  21.0
3  D   NaN    NaN  18.0  36.0
0  A   NaN    NaN   2.0   7.0
1  A   NaN    NaN   6.0   5.0
2  B   NaN    NaN   3.0   2.0
3  B   NaN    NaN   8.0   6.0

In [16]:
print(pd.concat([df1, df2, df3], axis = 1))

  id  var1  var2 id  var3  var4 id  var3  var4
0  A    37   120  A    12    75  A     2     7
1  B    36   117  B    16    54  A     6     5
2  C    43   230  C    13    21  B     3     2
3  D    23   315  D    18    36  B     8     6

In [17]:
pd.concat([df1, df2, df3], axis = 'columns')

  id  var1  var2 id  var3  var4 id  var3  var4
0  A    37   120  A    12    75  A     2     7
1  B    36   117  B    16    54  A     6     5
2  C    43   230  C    13    21  B     3     2
3  D    23   315  D    18    36  B     8     6

In [20]:
stud1 = pd.DataFrame({'ID': [1,2,3,4,5], 'names' : ['John', 'Greta', 'Francis', 'Laura', 'Charles'], 'Logic': [28, 27, 23, 25, 30]})

In [21]:
print(stud1)

   ID  Logic    names
0   1     28     John
1   2     27    Greta
2   3     23  Francis
3   4     25    Laura
4   5     30  Charles

In [19]:
stud2 = pd.DataFrame({'ID': [1,6,3,4,7], 'names' : ['John', 'Kate', 'Francis', 'Laura', 'Simon'], 'Analysis': [23, 24, 28, 29, 22]})

In [22]:
print(stud2)

   Analysis  ID    names
0        23   1     John
1        24   6     Kate
2        28   3  Francis
3        29   4    Laura
4        22   7    Simon

In [ ]:
# by default, the merge() function extracts common cases to the two datasets, so it is 'inner' by default

In [23]:
print(pd.merge(stud1, stud2, on = 'ID'))

   ID  Logic  names_x  Analysis  names_y
0   1     28     John        23     John
1   3     23  Francis        28  Francis
2   4     25    Laura        29    Laura

In [24]:
print(pd.merge(stud1, stud2, on = 'ID', how = 'left'))

   ID  Logic  names_x  Analysis  names_y
0   1     28     John      23.0     John
1   2     27    Greta       NaN      NaN
2   3     23  Francis      28.0  Francis
3   4     25    Laura      29.0    Laura
4   5     30  Charles       NaN      NaN

In [25]:
print(pd.merge(stud1, stud2, on = 'ID', how = 'right'))

   ID  Logic  names_x  Analysis  names_y
0   1   28.0     John        23     John
1   3   23.0  Francis        28  Francis
2   4   25.0    Laura        29    Laura
3   6    NaN      NaN        24     Kate
4   7    NaN      NaN        22    Simon

In [ ]:
# through 'outer' we merge the cases of the two dataframes 
# holding only a copy of the double cases but without losing some of the data from one of the two initial datasets

In [26]:
print(pd.merge(stud1, stud2, on = 'ID', how = 'outer'))

   ID  Logic  names_x  Analysis  names_y
0   1   28.0     John      23.0     John
1   2   27.0    Greta       NaN      NaN
2   3   23.0  Francis      28.0  Francis
3   4   25.0    Laura      29.0    Laura
4   5   30.0  Charles       NaN      NaN
5   6    NaN      NaN      24.0     Kate
6   7    NaN      NaN      22.0    Simon